<?php

namespace Database\Seeders;

use App\Models\Department;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $jsonDepartment = [
            [
                'name' => 'Dashboard',
                'slug' => '/',
                'type'  => '',
                'language' => ['lang' => 'kh', 'name' => "ផ្ទាំងគ្រប់គ្រង"],
                'description' => 'Dashboard master admin',
                'status' => true,
                'icon' => '<svg viewBox="0 0 17 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M3.70513 9.58974C7.25246 9.58974 7.41026 10.7928 7.41026 13.2949C7.41026 14.5485 7.41026 15.4404 6.88369 16.0933C6.27779 16.8457 5.17497 17 3.70513 17C2.23528 17 1.13246 16.8457 0.526564 16.0933C0 15.4404 0 14.5494 0 13.3167L0.653846 13.2949H0C0 10.7928 0.157795 9.58974 3.70513 9.58974ZM13.2949 9.58974C16.8422 9.58974 17 10.7928 17 13.2949C17 14.5485 17 15.4404 16.4734 16.0933C15.8675 16.8457 14.7647 17 13.2949 17C11.825 17 10.7222 16.8457 10.1163 16.0933C9.58974 15.4404 9.58974 14.5494 9.58974 13.3167L10.2436 13.2949H9.58974C9.58974 10.7928 9.74754 9.58974 13.2949 9.58974ZM3.88486 10.8978L3.70513 10.8974C1.43064 10.8974 1.314 11.0606 1.30802 12.9697L1.30838 13.7135C1.31251 14.4728 1.34144 15.0213 1.54395 15.2738C1.77497 15.5598 2.46108 15.6923 3.70513 15.6923C4.94918 15.6923 5.63528 15.5589 5.86631 15.273C6.10256 14.9792 6.10256 14.2817 6.10256 13.3158C6.10256 11.1361 6.10256 10.9081 3.88486 10.8978ZM13.4746 10.8978L13.2949 10.8974C11.0204 10.8974 10.9037 11.0606 10.8978 12.9697L10.8981 13.7135C10.9023 14.4728 10.9312 15.0213 11.1337 15.2738C11.3647 15.5598 12.0508 15.6923 13.2949 15.6923C14.5389 15.6923 15.225 15.5589 15.4561 15.273C15.6923 14.9792 15.6923 14.2817 15.6923 13.3158C15.6923 11.1361 15.6923 10.9081 13.4746 10.8978ZM3.70513 0C7.25246 0 7.41026 1.20308 7.41026 3.70513C7.41026 4.95877 7.41026 5.85062 6.88369 6.50359C6.27779 7.25595 5.17497 7.41026 3.70513 7.41026C2.23528 7.41026 1.13246 7.25595 0.526564 6.50359C0 5.85062 0 4.95964 0 3.72692L0.653846 3.70513H0C0 1.20308 0.157795 0 3.70513 0ZM13.2949 0C16.8422 0 17 1.20308 17 3.70513C17 4.95877 17 5.85062 16.4734 6.50359C15.8675 7.25595 14.7647 7.41026 13.2949 7.41026C11.825 7.41026 10.7222 7.25595 10.1163 6.50359C9.58974 5.85062 9.58974 4.95964 9.58974 3.72692L10.2436 3.70513H9.58974C9.58974 1.20308 9.74754 0 13.2949 0ZM3.88486 1.30808L3.70513 1.30769C1.43064 1.30769 1.314 1.4709 1.30802 3.37999L1.30838 4.12375C1.31251 4.88305 1.34144 5.43153 1.54395 5.6841C1.77497 5.97005 2.46108 6.10256 3.70513 6.10256C4.94918 6.10256 5.63528 5.96918 5.86631 5.68323C6.10256 5.38944 6.10256 4.692 6.10256 3.72605C6.10256 1.54639 6.10256 1.31834 3.88486 1.30808ZM13.4746 1.30808L13.2949 1.30769C11.0204 1.30769 10.9037 1.4709 10.8978 3.37999L10.8981 4.12375C10.9023 4.88305 10.9312 5.43153 11.1337 5.6841C11.3647 5.97005 12.0508 6.10256 13.2949 6.10256C14.5389 6.10256 15.225 5.96918 15.4561 5.68323C15.6923 5.38944 15.6923 4.692 15.6923 3.72605C15.6923 1.54639 15.6923 1.31834 13.4746 1.30808Z" fill="currentColor"/>
                    </svg>',
                'actions' => ['View Dashboard', 'Customize Dashboard'],
                'children' => [
                    [
                        'name' => 'New Recruit',
                        'slug' => '/',
                        'type'  => 'dashboard',
                        'language' => ['lang' => 'kh', 'name' => 'អ្នកប្រើ'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => '',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['View New Recruit'],
                        'children' => []
                    ], [
                        'name' => 'Top Sale',
                        'slug' => '/',
                        'type'  => 'dashboard',
                        'language' => ['lang' => 'kh', 'name' => 'អ្នកប្រើ'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => '',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['View Top Sale'],
                        'children' => []
                    ], [
                        'name' => 'Top Product',
                        'slug' => '/',
                        'type'  => 'dashboard',
                        'language' => ['lang' => 'kh', 'name' => 'ផលិតផលពេញនិយម'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => '',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['View To Product'],
                        'children' => []
                    ], [
                        'name' => 'Top Shop',
                        'slug' => '/',
                        'type'  => 'dashboard',
                        'language' => ['lang' => 'kh', 'name' => 'ហាងលក់ដាច់ខ្លាំង'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => '',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['View Top Shop'],
                        'children' => []
                    ], [
                        'name' => 'Recent Activities',
                        'slug' => '/',
                        'type'  => 'dashboard',
                        'language' => ['lang' => 'kh', 'name' => 'សកម្មភាពថ្មីៗ'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => '',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['View Recent Activities'],
                        'children' => []
                    ]
                ]
            ], [
                'name' => 'User Management',
                'slug' => '/user',
                'type'  => 'list',
                'language' => ['lang' => 'kh', 'name' => "គណនីអ្នកប្រើប្រាស់"],
                'description' => 'User management progress',
                'status' => true,
                'icon' => '<svg viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                    </svg>',
                'actions' => ['User', 'Role'],
                'children' => [
                    [
                        'name' => 'User',
                        'slug' => '/user/list',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'អ្នកប្រើ'],
                        'description' => 'user management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M9 0.5C4.032 0.5 0 4.532 0 9.5C0 14.468 4.032 18.5 9 18.5C13.968 18.5 18 14.468 18 9.5C18 4.532 13.968 0.5 9 0.5ZM12.249 6.206C13.212 6.206 13.986 6.98 13.986 7.943C13.986 8.906 13.212 9.68 12.249 9.68C11.286 9.68 10.512 8.906 10.512 7.943C10.503 6.98 11.286 6.206 12.249 6.206ZM6.849 4.784C8.019 4.784 8.973 5.738 8.973 6.908C8.973 8.078 8.019 9.032 6.849 9.032C5.679 9.032 4.725 8.078 4.725 6.908C4.725 5.729 5.67 4.784 6.849 4.784ZM6.849 13.001V16.376C4.689 15.701 2.979 14.036 2.223 11.912C3.168 10.904 5.526 10.391 6.849 10.391C7.326 10.391 7.929 10.463 8.559 10.589C7.083 11.372 6.849 12.407 6.849 13.001ZM9 16.7C8.757 16.7 8.523 16.691 8.289 16.664V13.001C8.289 11.723 10.935 11.084 12.249 11.084C13.212 11.084 14.877 11.435 15.705 12.119C14.652 14.792 12.051 16.7 9 16.7Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['Create User', 'Edit User', 'Reset Password', 'Change Password', 'Change Role', "View Profile"],
                        'children' => []
                    ], [
                        'name' => 'Role',
                        'slug' => '/user/role',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => "កំណត់សិទ្ធិ"],
                        'description' => 'user management and apply role & permission',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<svg width="15px" height="17px" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M10.0489 6.28202C10.2929 6.28202 10.5298 6.31073 10.7667 6.34662V2.88693L5.38333 0.539795L0 2.88693V6.41122C0 9.66993 2.29689 12.7205 5.38333 13.4598C5.77811 13.3665 6.15854 13.2301 6.53178 13.065C6.03651 12.3616 5.74222 11.5074 5.74222 10.5887C5.74222 8.21284 7.67305 6.28202 10.0489 6.28202Z" fill="currentColor"/>
                                <path d="M10.0503 7.71802C8.46402 7.71802 7.1792 9.00284 7.1792 10.5891C7.1792 12.1754 8.46402 13.4602 10.0503 13.4602C11.6366 13.4602 12.9214 12.1754 12.9214 10.5891C12.9214 9.00284 11.6366 7.71802 10.0503 7.71802ZM10.0503 8.70855C10.4953 8.70855 10.8542 9.07462 10.8542 9.51246C10.8542 9.95031 10.4882 10.3164 10.0503 10.3164C9.61247 10.3164 9.2464 9.95031 9.2464 9.51246C9.2464 9.07462 9.60529 8.70855 10.0503 8.70855ZM10.0503 12.563C9.38278 12.563 8.80138 12.2328 8.44249 11.7232C8.47838 11.2064 9.52633 10.948 10.0503 10.948C10.5743 10.948 11.6222 11.2064 11.6581 11.7232C11.2992 12.2328 10.7178 12.563 10.0503 12.563Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['Set Permission', 'Create Role', 'Edit Role', 'Delete Role'],
                        'children' => []
                    ]
                ]
            ], [
                'name' => 'Sales',
                'slug' => '/sale',
                'type'  => 'list',
                'language' => ['lang' => 'kh', 'name' => "ការលក់"],
                'description' => 'sale application form and success application',
                'status' => true,
                'icon' => '<svg viewBox="0 0 19 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M16.8889 0.609985H2.11111C0.95 0.609985 0 1.39899 0 2.36332V14.6367C0 15.601 0.95 16.39 2.11111 16.39H16.8889C18.05 16.39 19 15.601 19 14.6367V2.36332C19 1.39899 18.05 0.609985 16.8889 0.609985ZM6.33333 12.8833H4.22222V6.74665H6.33333V12.8833ZM10.5556 12.8833H8.44444V4.11665H10.5556V12.8833ZM14.7778 12.8833H12.6667V9.37665H14.7778V12.8833Z" fill="currentColor"/>
                    </svg>',
                'actions' => ['Application', 'Sale'],
                'children' => [
                    [
                        'name' => 'Application',
                        'slug' => '/sale/application',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "សំណើរអតិថិជន"],
                        'description' => 'application form',
                        'status' => true,
                        'icon' => '<svg width="15" height="12" viewBox="0 0 15 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M13.3333 0H1.33333C0.6 0 0 0.6 0 1.33333V9.33333C0 10.0667 0.6 10.6667 1.33333 10.6667H4.66667V12H10V10.6667H13.3333C14.0667 10.6667 14.66 10.0667 14.66 9.33333L14.6667 1.33333C14.6667 0.6 14.0667 0 13.3333 0ZM13.3333 9.33333H1.33333V1.33333H13.3333V9.33333ZM12 3.33333H4.66667V4.66667H12V3.33333ZM12 6H4.66667V7.33333H12V6ZM4 3.33333H2.66667V4.66667H4V3.33333ZM4 6H2.66667V7.33333H4V6Z" fill="currentColor"/>
                            </svg>',
                        'actions' => ['Create Application', 'Edit Application', 'Preview Application', 'Update Application Status', 'Delete Application'],
                        'children' => []
                    ], [
                        'name' => 'Sale',
                        'slug' => '/sale/list',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "ការលក់"],
                        'description' => 'Sale application',
                        'status' => true,
                        'icon' => '<svg width="12" height="12" viewBox="0 0 12 12" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M12 4H9.23077V12H12V4ZM12 0H9.23077V3.2H12V0ZM2.76923 8.8H-5.96046e-08V12H2.76923V8.8ZM2.76923 6.4H-5.96046e-08V8H2.76923V6.4ZM7.38462 6.4H4.61538V12H7.38462V6.4ZM7.38462 3.2H4.61538V5.6H7.38462V3.2Z" fill="currentColor"/>
                    </svg>',
                        'actions' => ['Preview Sale'],
                        'children' => []
                    ]
                ]
            ], [
                'name' => 'Other Management',
                'slug' => '/manage',
                'type'  => 'list',
                'language' => ['lang' => 'kh', 'name' => "គ្រប់គ្រងផ្សេងៗ"],
                'description' => 'Other management',
                'status' => true,
                'icon' => '<i class="bi bi-grid-fill"></i>',
                'actions' => ['Shop', 'Product'],
                'children' => [
                    [
                        'name' => 'Shop',
                        'slug' => '/manage/shop',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'ហាង'],
                        'description' => 'Shop management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<i class="bi bi-shop"></i>',
                        'actions' => ['Create Shop', 'Edit Shop', "View Shop", "Assign User Shop"],
                        'children' => []
                    ], [
                        'name' => 'Product',
                        'slug' => '/manage/product',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'ទំនិញ'],
                        'description' => 'Product management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<i class="bi bi-list-ul"></i>',
                        'actions' => ['Create Product', 'Edit Product', 'View Product'],
                        'children' => []
                    ], [
                        'name' => 'Co',
                        'slug' => '/manage/co',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'មន្ត្រីឥណទាន'],
                        'description' => 'Co management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<i class="bi bi-person-gear"></i>',
                        'actions' => ['Create Co', 'Edit Co', 'View Co'],
                        'children' => []
                    ], [
                        'name' => 'Co',
                        'slug' => '/manage/mfi',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'គ្រឹះស្ថានមីក្រូហិរញ្ញវត្ថុ'],
                        'description' => 'MFI management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<i class="bi bi-buildings"></i>',
                        'actions' => ['Create Mfi', 'Edit Mfi', 'View Mfi'],
                        'children' => []
                    ], [
                        'name' => 'Co',
                        'slug' => '/manage/occupation',
                        'type'  => '',
                        'language' => ['lang' => 'kh', 'name' => 'មុខរបរ'],
                        'description' => 'Occupation management',
                        'status' => true,
                        'type' => 'menu',
                        'icon' => '<i class="bi bi-hammer"></i>',
                        'actions' => ['Create Occupation', 'Edit Occupation', 'View Occupation'],
                        'children' => []
                    ]
                ]
            ], [
                'name' => 'Report',
                'slug' => '/report',
                'type'  => 'list',
                'language' => ['lang' => 'kh', 'name' => "របាយការណ៍"],
                'description' => 'reporting for  management export ',
                'status' => true,
                'icon' => '<svg viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M17.41 5.91L12.58 1.08C12.21 0.71 11.7 0.5 11.17 0.5H2C0.9 0.5 0 1.4 0 2.5V16.5C0 17.6 0.9 18.5 2 18.5H16C17.1 18.5 18 17.6 18 16.5V7.33C18 6.8 17.79 6.29 17.41 5.91ZM4 4.5H11V6.5H4V4.5ZM14 14.5H4V12.5H14V14.5ZM14 10.5H4V8.5H14V10.5Z" fill="currentColor"/>
                        </svg>',
                'actions' => ['Sale Summary Report by Company', 'Sale Performance by Channel', 'Sale Summary by Channel', 'Summary of shop Performance'],
                'children' => [
                    [
                        'name' => 'Sale Summary Report by Company',
                        'slug' => '/report/sale-summary-by-comapny',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "របាយការណ៍ភា្នក់ងារប្រឹក្សា"],
                        'description' => 'agency payroll by monthly and commission fee ',
                        'status' => true,
                        'icon' => '<svg width="15" height="15" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M17.0663 12.0369C17.432 12.0644 17.7057 12.384 17.6782 12.7498L17.51 14.9715C17.3709 16.8045 15.8239 18.24 13.9865 18.24H3.71448C1.87703 18.24 0.330032 16.8045 0.191006 14.9715L0.0227578 12.7498C-0.00469324 12.384 0.269817 12.0644 0.635536 12.0369C1.00303 12.0236 1.32004 12.2831 1.34838 12.6497L1.51574 14.8706C1.60252 16.0147 2.56773 16.9117 3.71448 16.9117H13.9865C15.1332 16.9117 16.0993 16.0147 16.1852 14.8706L16.3535 12.6497C16.3818 12.2831 16.7068 12.0227 17.0663 12.0369ZM9.99297 0.759766C11.3239 0.759766 12.4264 1.75709 12.5925 3.04354L14.3365 3.04431C16.1926 3.04431 17.7015 4.55766 17.7015 6.41902V9.46431C17.7015 9.70075 17.5757 9.91858 17.373 10.0372C15.1872 11.3173 12.4184 12.0638 9.51448 12.1634L9.5148 13.7561C9.5148 14.1228 9.21726 14.4203 8.85066 14.4203C8.48405 14.4203 8.18652 14.1228 8.18652 13.7561L8.18594 12.1637C5.28493 12.065 2.51589 11.3182 0.328527 10.0372C0.124858 9.91858 0 9.70075 0 9.46431V6.41016C0 4.55412 1.51335 3.04431 3.37382 3.04431L5.10882 3.04354C5.27489 1.75709 6.37746 0.759766 7.70834 0.759766H9.99297ZM14.3365 4.37259H3.37382C2.24567 4.37259 1.32828 5.28644 1.32828 6.41016V9.07734C3.43024 10.2194 6.08017 10.8454 8.83834 10.8466L8.85066 10.8455L8.86049 10.8458L9.28213 10.8414C11.8907 10.7793 14.3791 10.1604 16.3732 9.07734V6.41902C16.3732 5.28998 15.4602 4.37259 14.3365 4.37259ZM9.99297 2.08804H7.70834C7.11208 2.08804 6.60876 2.49385 6.46007 3.04376H11.2412C11.0926 2.49385 10.5892 2.08804 9.99297 2.08804Z" fill="currentColor"/>
                        </svg>',
                        'actions' => [],
                        'children' => []
                    ], [
                        'name' => 'Sale Performance by Channel',
                        'slug' => '/report/sale-performance-by-channel',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "ការអនុវត្តការលក់ដោយឆានែល"],
                        'description' => 'finace payroll by monthly and commission fee ',
                        'status' => true,
                        'icon' => '<svg width="15px" height="15px" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0 4.4H2.78571V13.5H0V4.4ZM5.2 0.5H7.8V13.5H5.2V0.5ZM10.4 7.92857H13V13.5H10.4V7.92857Z" fill="#B7B7B7"/>
                        </svg>',
                        'actions' => [],
                        'children' => [],
                    ], [
                        'name' => 'Sale Summary by Channel',
                        'slug' => '/report/sale-summary-by-channel',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "សេចក្តីសង្ខេបនៃការលក់ដោយឆានែល"],
                        'description' => 'Sale Summary by Channel',
                        'status' => true,
                        'icon' => '<svg width="15px" height="15px" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0 4.4H2.78571V13.5H0V4.4ZM5.2 0.5H7.8V13.5H5.2V0.5ZM10.4 7.92857H13V13.5H10.4V7.92857Z" fill="#B7B7B7"/>
                        </svg>',
                        'actions' => [],
                        'children' => [],
                    ], [
                        'name' => 'Summary of shop Performance',
                        'slug' => '/report/summary-of-shop-performance',
                        'type'  => 'menu',
                        'language' => ['lang' => 'kh', 'name' => "សេចក្តីសង្ខេបនៃដំណើរការហាង"],
                        'description' => 'Summary of shop Performance',
                        'status' => true,
                        'icon' => '<svg width="15px" height="15px" viewBox="0 0 13 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M0 4.4H2.78571V13.5H0V4.4ZM5.2 0.5H7.8V13.5H5.2V0.5ZM10.4 7.92857H13V13.5H10.4V7.92857Z" fill="#B7B7B7"/>
                        </svg>',
                        'actions' => [],
                        'children' => [],
                    ]
                ]
            ], [
                'name' => 'Setting',
                'slug' => '/setting',
                'type'  => '',
                'language' => ['lang' => 'kh', 'name' => "ការកំណត់ផ្សេងៗ"],
                'description' => 'reporting for management export ',
                'status' => true,
                'icon' => '<svg width="18px" height="19px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M10.9516 11.057L12.2116 8.87897C12.2926 8.74398 12.2566 8.57298 12.1396 8.47398L10.8076 7.42999C10.8346 7.23199 10.8526 7.02499 10.8526 6.818C10.8526 6.611 10.8346 6.404 10.8076 6.197L12.1396 5.15302C12.2566 5.05402 12.2926 4.88302 12.2116 4.74802L10.9516 2.57004C10.8706 2.43505 10.7086 2.38105 10.5646 2.43505L8.99859 3.06504C8.67459 2.81304 8.3236 2.60604 7.9366 2.44405L7.7026 0.779063C7.6756 0.635065 7.5406 0.518066 7.38761 0.518066H4.86763C4.71463 0.518066 4.57964 0.635065 4.55264 0.788063L4.31864 2.45305C3.94064 2.61504 3.58065 2.82204 3.25665 3.07404L1.69067 2.44405C1.54667 2.39005 1.38467 2.44405 1.30367 2.57904L0.0436842 4.75702C-0.037315 4.89202 -0.00131521 5.06302 0.115684 5.16201L1.44767 6.206C1.42067 6.404 1.40267 6.611 1.40267 6.818C1.40267 7.02499 1.42067 7.23199 1.44767 7.43899L0.115684 8.48298C-0.00131521 8.58198 -0.037315 8.75298 0.0436842 8.88797L1.30367 11.066C1.38467 11.2009 1.54667 11.2549 1.69067 11.2009L3.25665 10.571C3.58065 10.823 3.93164 11.03 4.31864 11.1919L4.55264 12.8569C4.57964 13.0009 4.71463 13.1179 4.86763 13.1179H7.38761C7.5406 13.1179 7.6756 13.0009 7.7026 12.8479L7.9366 11.1829C8.3146 11.021 8.67459 10.814 8.99859 10.562L10.5646 11.1919C10.7086 11.2459 10.8706 11.1919 10.9516 11.057ZM6.12762 8.61798C5.13763 8.61798 4.32764 7.80799 4.32764 6.818C4.32764 5.82801 5.13763 5.01802 6.12762 5.01802C7.11761 5.01802 7.9276 5.82801 7.9276 6.818C7.9276 7.80799 7.11761 8.61798 6.12762 8.61798Z" fill="currentColor"/>
                        <path d="M17.9264 15.5209L17.0624 14.8549C17.0804 14.7289 17.0984 14.5939 17.0984 14.4589C17.0984 14.3239 17.0894 14.1889 17.0624 14.0629L17.9174 13.3969C17.9894 13.3339 18.0164 13.2259 17.9624 13.1359L17.1524 11.741C17.1074 11.651 16.9994 11.624 16.9004 11.651L15.9014 12.056C15.6944 11.894 15.4694 11.759 15.2174 11.66L15.0644 10.598C15.0554 10.49 14.9654 10.418 14.8754 10.418H13.2645C13.1655 10.418 13.0755 10.49 13.0665 10.589L12.9135 11.651C12.6705 11.759 12.4365 11.885 12.2295 12.047L11.2305 11.642C11.1405 11.606 11.0325 11.642 10.9785 11.732L10.1685 13.1269C10.1235 13.2169 10.1325 13.3249 10.2135 13.3879L11.0685 14.0539C11.0505 14.1799 11.0415 14.3149 11.0415 14.4499C11.0415 14.5849 11.0505 14.7199 11.0685 14.8459L10.2135 15.5119C10.1415 15.5749 10.1145 15.6829 10.1685 15.7729L10.9785 17.1679C11.0235 17.2579 11.1315 17.2849 11.2305 17.2579L12.2295 16.8529C12.4365 17.0149 12.6615 17.1499 12.9135 17.2489L13.0665 18.3109C13.0845 18.4099 13.1655 18.4819 13.2645 18.4819H14.8754C14.9744 18.4819 15.0644 18.4099 15.0734 18.3109L15.2264 17.2489C15.4694 17.1409 15.7034 17.0149 15.9014 16.8529L16.9094 17.2579C16.9994 17.2939 17.1074 17.2579 17.1614 17.1679L17.9714 15.7729C18.0254 15.6919 17.9984 15.5839 17.9264 15.5209ZM14.0655 15.6649C13.3995 15.6649 12.8505 15.1249 12.8505 14.4499C12.8505 13.7749 13.3905 13.2349 14.0655 13.2349C14.7404 13.2349 15.2804 13.7749 15.2804 14.4499C15.2804 15.1249 14.7314 15.6649 14.0655 15.6649Z" fill="currentColor"/>
                    </svg>',
                'actions' => ['Languages', 'Exchange Rage', 'System Logs'],
                'children' => [
                    [
                        'name' => 'Languages',
                        'slug' => '/setting/language',
                        'language' => ['lang' => 'kh', 'name' => "ភាសា"],
                        'description' => 'system hav multipl language',
                        'status' => true,
                        'type'  => 'menu',
                        'icon' => '<svg width="22px" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M11.3636 2.45455H5.68182L5.11364 0.75H1.13636C0.511364 0.75 0 1.26136 0 1.88636V10.4091C0 11.0341 0.511364 11.5455 1.13636 11.5455H5.68182L6.25 13.25H11.3636C11.9886 13.25 12.5 12.7386 12.5 12.1136V3.59091C12.5 2.96591 11.9886 2.45455 11.3636 2.45455ZM3.40909 9.27273C1.84091 9.27273 0.568182 8 0.568182 6.43182C0.568182 4.86364 1.84091 3.59091 3.40909 3.59091C4.17614 3.59091 4.81818 3.875 5.3125 4.32955L4.5625 5.05114C4.34659 4.84659 3.97159 4.60795 3.40909 4.60795C2.42045 4.60795 1.61932 5.42614 1.61932 6.43182C1.61932 7.4375 2.42045 8.25568 3.40909 8.25568C4.55114 8.25568 5.02273 7.4375 5.06818 6.88636H3.40909V5.91477H6.06818C6.10795 6.09091 6.13636 6.26136 6.13636 6.49432C6.13636 8.11932 5.05114 9.27273 3.40909 9.27273ZM6.91477 6.19318H9.01705C8.77273 6.90341 8.38636 7.57386 7.85227 8.16477C7.67614 7.96591 7.51136 7.75568 7.36364 7.53977L6.91477 6.19318ZM11.6477 11.8295C11.6477 12.142 11.392 12.3977 11.0795 12.3977H7.38636L8.52273 10.9773L7.93182 9.21591L9.69318 10.9773L10.2159 10.4545L8.34091 8.60795L8.35227 8.59659C8.99432 7.88636 9.44886 7.06818 9.71591 6.19886H10.7955V5.46023H8.22159V4.72727H7.48864V5.46023H6.67045L5.94318 3.30682H11.0795C11.392 3.30682 11.6477 3.5625 11.6477 3.875V11.8295Z" fill="currentColor"/>
                                    </svg>',
                        'actions' => ['Change Language'],
                        'children' => []
                    ], [
                        'name' => 'System Logs',
                        'slug' => '/setting/system-log',
                        'language' => ['lang' => 'kh', 'name' => "កំណត់ហេតុផ្សេងៗ"],
                        'description' => 'user Activities ',
                        'status' => true,
                        'type'  => 'menu',
                        'icon' => '<i class="bi bi-justify"></i>',
                        'actions' => ['View System Logs'],
                        'children' => []
                    ]
                ]
            ]
        ];

        foreach ($jsonDepartment as $i => $item) {
            $parent = DB::table('departments')->insertGetId([
                'name' => $item['name'],
                'slug' => $item['slug'],
                'type' => $item['type'],
                'icon' => $item['icon'],
                'languages' => json_encode($item['language'], JSON_UNESCAPED_UNICODE),
                'description' => $item['description'],
                'status' => $item['status'],
                'sort' => $i
            ]);
            foreach ($item['actions'] as $item_key => $action) {
                DB::table('permissions')->insert([
                    'sort' => $item_key,
                    'action' => $action,
                    'scope' => $parent,
                    'department_id' => $parent,
                ]);
            }

            foreach ($item['children'] as $index => $children_sub) {
                $childrenGetId = DB::table('departments')->insertGetId([
                    'name' => $children_sub['name'],
                    'slug' => $children_sub['slug'],
                    'icon' => $children_sub['icon'],
                    'languages' => json_encode($children_sub['language'], JSON_UNESCAPED_UNICODE),
                    'description' => $children_sub['description'],
                    'status' => $children_sub['status'],
                    'sort' => $index,
                    'type' => $children_sub['type'],
                    'parent_id' => $parent
                ]);
                foreach ($children_sub['actions'] as  $child_key => $action_child) {
                    DB::table('permissions')->insert([
                        'sort' => $child_key,
                        'action' => $action_child,
                        'scope' =>  $childrenGetId,
                        'department_id' => $childrenGetId,
                    ]);
                }
            }
        }
    }
}
